format long
clear all

x = [44, 89.5, 6.82, 62, 178;
    40, 75.1, 6.04, 62, 185;
    44, 85.8, 5.19, 45, 156;
    42, 68.2, 4.90, 40, 166;
    38, 89.0, 5.53, 55, 178;
    47, 77.5, 6.98, 58, 176;
    40, 76.0, 7.17, 70, 176;
    43, 81.2, 6.51, 64, 162;
    44, 81.4, 7.85, 63, 174;
    38, 81.9, 5.18, 48, 170;
    44, 73.0, 6.08, 45, 168;
    45, 87.7, 8.42, 56, 186;
    45, 66.5, 6.67, 51, 176;
    47, 79.2, 6.36, 47, 162;
    54, 83.1, 6.20, 50, 166;
    49, 81.4, 5.37, 44, 180;
    51, 69.6, 6.57, 57, 168;
    51, 77.9, 6.00, 48, 162;
    48, 91.6, 6.15, 48, 162;
    47, 73.4, 6.05, 67, 168;
    57, 73.4, 7.58, 58, 174;
    54, 79.4, 6.70, 62, 156;
    52, 76.3, 5.78, 48, 164;
    50, 70.9, 5.35, 48, 146];

y = [44.6, 45.3, 54.3, 59.6, 49.9, 44.8, 45.7, 49.1, 39.4, 60.1, 50.5, 37.4, 44.8, 47.2, 51.9, 49.2, 40.9, 46.7, 46.8, 50.4, 39.4, 46.1, 45.4, 54.7];

% 第一问
disp('--------------第一问--------------')
for i = 1:5
    figure(1), subplot(2, 3, i), scatter(x(:, i), y), xlabel(sprintf('x_%d', i)), ylabel('y');
    [b, bint, r, rint, s] = regress(y', [ones(24, 1), x(:, i)]);
    disp(['变量 x_', num2str(i), ' 的线性回归结果：'])
    disp('系数 b：')
    disp(b)
    disp('系数的置信区间 bint：')
    disp(bint)
    disp('回归的标准误差 s：')
    disp(s)
end

% 第二问
disp('--------------第二问--------------')
stepwise(x, y');
[b, bint, r, rint, s] = regress(y', [ones(24, 1), x(:, 1), x(:, 3)]);
disp('逐步回归结果：')
disp('系数 b：')
disp(b)
disp('系数的置信区间 bint：')
disp(bint)
disp('回归的标准误差 s：')
disp(s)

% 第三问
disp('--------------第三问--------------')
[b, bint, r, rint, s] = regress(y', [ones(24, 1), x(:, 1), x(:, 3), x(:, 5)]);
disp('多变量回归结果：')
disp('系数 b：')
disp(b)
disp('系数的置信区间 bint：')
disp(bint)
disp('回归的标准误差 s：')
disp(s)

figure(2), rcoplot(r, rint);

% 第四问
disp('--------------第四问--------------')
new_x = [];
new_y = [];
index = 1;

for i = [1:9, 11:14, 16:24]
    new_x(index, :) = x(i, :);
    new_y(index) = y(i);
    index = index + 1;
end

[b, bint, r, rint, s] = regress(new_y', [ones(22, 1), new_x(:, 1), new_x(:, 3), new_x(:, 5)]);
disp('移除异常值后的回归结果：')
disp('系数 b：')
disp(b)
disp('系数的置信区间 bint：')
disp(bint)
disp('回归的标准误差 s：')
disp(s)
